/* 패키지 멤버 클래스
 * => 패키지에 소속된 클래스이다.
 * => 우리가 일반적으로 만드는 클래스를 말한다. 
 * => 보통 한 개의 소스 파일 당 한 개의 패키지 멤버 클래스를 정의한다.
 * 
 */
package step15.ex1;

// Test01은 패키지에 소속된 클래스이다.
// 그래서 "패키지 멤버 클래스"라고 부른다.
public class Test01_1 {
  public static void main(String[] args) {
    
  }
}

// 보통 소스 파일 하나당 한개의 패키지 멤버를 정의하는데,
// 다음과 같이 여러 개를 정의할 경우도 있다.
// 단 소스 파일당 오직 한 개의 클래스만이 public modifier를 붙일 수 있다.
// public이 붙은 클래스가 있다면 반드시 소스 파일 이름이 그 클래스와 같아야 한다.
class MyClass {
  
}










